In [30]:
# importing pands and seaborn

import pandas as pd
import seaborn as sns

In [31]:
# creating and loading the iris database

df_iris = sns.load_dataset('iris')

In [32]:
# print the first 3 rows

df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [33]:
# print the number of rows and columns (shape)

df_iris.shape

(150, 5)

In [34]:
# print the column names

df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [35]:
# print the data type of each column

df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [36]:
# print the summary statistics for each of the numeric variables

df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [37]:
# print the unique values for each of your categorical variables

df_iris.nunique()

sepal_length    35
sepal_width     23
petal_length    43
petal_width     22
species          3
dtype: int64

In [38]:
# Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel

df_excel = pd.read_excel("Cust_Churn_Telco.xlsx")

In [39]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample= [df_excel.head(100)]
df_excel_sample

[    customerID  gender  SeniorCitizen Partner Dependents  tenure PhoneService  \
 0   7590-VHVEG  Female              0     Yes         No       1           No
 1   5575-GNVDE    Male              0      No         No      34          Yes
 2   3668-QPYBK    Male              0      No         No       2          Yes
 3   7795-CFOCW    Male              0      No         No      45           No
 4   9237-HQITU  Female              0      No         No       2          Yes
 ..         ...     ...            ...     ...        ...     ...          ...
 95  8637-XJIVR  Female              0      No         No      12          Yes
 96  9803-FTJCG    Male              0     Yes        Yes      71          Yes
 97  0278-YXOOG    Male              0      No         No       5          Yes
 98  3212-KXOCR    Male              0      No         No      52          Yes
 99  4598-XLKNJ  Female              1     Yes         No      25          Yes

        MultipleLines InternetService       OnlineSecurity  ...  \
 0   No phone service             DSL                   No  ...
 1                 No             DSL                  Yes  ...
 2                 No             DSL                  Yes  ...
 3   No phone service             DSL                  Yes  ...
 4                 No     Fiber optic                   No  ...
 ..               ...             ...                  ...  ...
 95               Yes     Fiber optic                  Yes  ...
 96               Yes             DSL                  Yes  ...
 97                No              No  No internet service  ...
 98                No              No  No internet service  ...
 99                No     Fiber optic                   No  ...

        DeviceProtection          TechSupport          StreamingTV  \
 0                    No                   No                   No
 1                   Yes                   No                   No
 2                    No                   No                   No
 3                   Yes                  Yes                   No
 4                    No                   No                   No
 ..                  ...                  ...                  ...
 95                   No                   No                   No
 96                   No                  Yes                   No
 97  No internet service  No internet service  No internet service
 98  No internet service  No internet service  No internet service
 99                  Yes                   No                  Yes

         StreamingMovies        Contract PaperlessBilling  \
 0                    No  Month-to-month              Yes
 1                    No        One year               No
 2                    No  Month-to-month              Yes
 3                    No        One year               No
 4                    No  Month-to-month              Yes
 ..                  ...             ...              ...
 95                   No  Month-to-month              Yes
 96                   No        One year              Yes
 97  No internet service  Month-to-month               No
 98  No internet service        Two year               No
 99                  Yes  Month-to-month              Yes

                 PaymentMethod MonthlyCharges  TotalCharges  Churn
 0            Electronic check          29.85         29.85     No
 1                Mailed check          56.95       1889.50     No
 2                Mailed check          53.85        108.15    Yes
 3   Bank transfer (automatic)          42.30       1840.75     No
 4            Electronic check          70.70        151.65    Yes
 ..                        ...            ...           ...    ...
 95           Electronic check          78.95        927.35    Yes
 96    Credit card (automatic)          66.85       4748.70     No
 97               Mailed check          21.05        113.85    Yes
 98  Bank transfer (automatic)          21.00       1107.20     No
 99           Electronic check          98.50       2514.50    Yes

 [100 rows x 21 columns]]

In [40]:
# print the number of rows of your original dataframe
len(df_excel.index)

7043

In [41]:
# print the first 5 column names
df_excel.columns[:5]

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents'], dtype='object')

In [42]:
# print the column names that have a data type of object
df_excel.select_dtypes(include=['object']).columns

Index(['customerID', 'gender', 'Partner', 'Dependents', 'PhoneService',
       'MultipleLines', 'InternetService', 'OnlineSecurity', 'OnlineBackup',
       'DeviceProtection', 'TechSupport', 'StreamingTV', 'StreamingMovies',
       'Contract', 'PaperlessBilling', 'PaymentMethod', 'Churn'],
      dtype='object')

In [43]:
df_excel.head()

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes

In [44]:
df_excel.max()

customerID            9995-HOTOH
gender                      Male
SeniorCitizen                  1
Partner                      Yes
Dependents                   Yes
tenure                        72
PhoneService                 Yes
MultipleLines                Yes
InternetService               No
OnlineSecurity               Yes
OnlineBackup                 Yes
DeviceProtection             Yes
TechSupport                  Yes
StreamingTV                  Yes
StreamingMovies              Yes
Contract                Two year
PaperlessBilling             Yes
PaymentMethod       Mailed check
MonthlyCharges            118.75
TotalCharges              8684.8
Churn                        Yes
dtype: object

In [45]:
df_excel.min()

customerID                         0002-ORFBO
gender                                 Female
SeniorCitizen                               0
Partner                                    No
Dependents                                 No
tenure                                      0
PhoneService                               No
MultipleLines                              No
InternetService                           DSL
OnlineSecurity                             No
OnlineBackup                               No
DeviceProtection                           No
TechSupport                                No
StreamingTV                                No
StreamingMovies                            No
Contract                       Month-to-month
PaperlessBilling                           No
PaymentMethod       Bank transfer (automatic)
MonthlyCharges                          18.25
TotalCharges                             18.8
Churn                                      No
dtype: object

In [46]:
tenure_range = df_excel.tenure.max() - df_excel.tenure.min()
month_range = df_excel.MonthlyCharges.max() - df_excel.MonthlyCharges.min()
total_range = df_excel.TotalCharges.max() - df_excel.TotalCharges.min()

In [47]:
# compute the range for each of the numeric variables.
print(tenure_range, month_range, total_range)

72 100.5 8666.0

In [48]:
# Read the data from this google sheet into a dataframe, df_google

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
# print the first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [50]:
# print the number of rows and columns
df_google.shape

(891, 12)

In [51]:
# print the column names
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
# print the data type of each column
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [53]:
# print the summary statistics for each of the numeric variables

df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [61]:

from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/titanic_db'
    
def get_db_url(user,password,host,database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [62]:

import pandas as pd
from env import user, password, host

pd.read_sql("select * from passengers", get_db_url(user, password, host, 'titanic_db'))

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,None,Queenstown,1

In [63]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/iris_db'
    
def get_db_url(user,password,host,database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [66]:
import pandas as pd
from env import user, password, host

pd.read_sql("select * from species join measurements using(species_id)", get_db_url(user, password, host, 'iris_db'))

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2
...,...,...,...,...,...,...,...
145,3,virginica,146,6.7,3.0,5.2,2.3
146,3,virginica,147,6.3,2.5,5.0,1.9
147,3,virginica,148,6.5,3.0,5.2,2.0
148,3,virginica,149,6.2,3.4,5.4,2.3
149,3,virginica,150,5.9,3.0,5.1,1.8

In [67]:
df.to_csv("get_titanic_data.csv")

NameError: name 'df' is not defined